import pandas as pd
import matplotlib.pyplot as plt
from matplotlib import rc 
rc('font', family='AppleGothic') 
plt.rcParams['axes.unicode_minus'] = False 

data = {
    "년도": [2019, 2019, 2020, 2020, 2021, 2021],
    "1호선": [172369, 85610, 115584, 56164, 111548, 51690],
    "2호선": [811960, 551832, 577744, 393797, 571437, 373933],
    "3호선": [329661, 195066, 235105, 140437, 237469, 136370],
    "4호선": [326793, 195358, 222536, 132561, 219587, 124245],
    "5호선": [333836, 208255, 258551, 165968, 276001, 174299],
    "6호선": [204576, 119175, 148148, 87095, 150515, 86160],
    "7호선": [380143, 251296, 289974, 195097, 295930, 192378],
    "8호선": [112087, 64795, 86820, 50831, 88547, 50227],
    "9호선": [224909, 129422, 171634, 101290, 181126, 106639],
    "우이신설선": [27310, 12201, 21121, 9560, 22156, 10086]
}

df = pd.DataFrame(data)

fig, ax = plt.subplots(figsize=(8, 5))
width = 0.12
x = [-1.5, -0.5, 0.5, 1.5, 2.5, 3.5]
for idx, line_name in enumerate(df.columns[1:]):
    ax.bar(x, df[line_name], width, label=line_name)
    x = [x_i + width for x_i in x]

ax.set_title("년도별 수송인원 및 운수수입")
ax.set_ylabel("수치 (천명 / 백만원)")
ax.set_xticks([0, 0.75, 1.75, 2.75, 3.75, 4.75])
ax.set_xticklabels(["2019 인원", "2019 수입", "2020 인원", "2020 수입", "2021 인원", "2021 수입"])
plt.legend()
plt.show()

